[{"date":-62135596800,"excerpt":"\u003cp\u003eYou can file a claim several ways. The best way is to contact the insurance company directly. For contact information by carrier, click here. You can also complete the File a Claim form on our website or call us.\u003c/p\u003e\n","href":"/faqs/personal-insurance/how-do-i-file-a-claim/","link":"how-do-i-file-a-claim","objectID":"f99e65595acbf72b0409b511d7734765","title":"How do I file a claim?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eMany natural disasters, such as hurricanes or tornadoes, are covered in a homeowner policy. Others, like earthquake and flood are not. Let us know if you have any concerns about your protection from loss due to natural or even man made disasters; we\u0026rsquo;ll be happy to review your insurance program and let you know what, if any, changes you might want to consider.\u003c/p\u003e\n","href":"/faqs/personal-insurance/are-natural-disasters-such-as-flood-earthquakes-and-hurricanes-covered-under-my-homeowner-policy/","link":"are-natural-disasters-such-as-flood-earthquakes-and-hurricanes-covered-under-my-homeowner-policy","objectID":"ac71915d1440ab4f5149c8273c1fb86a","title":"Are natural disasters such as flood, earthquakes and hurricanes covered under my homeowner policy?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eThe association master policy is for coverage to the structure, which you don\u0026rsquo;t need. However, to get protection for your own possessions and for legal liability related to your own unit, you need your own policy. Many condominium associations will assess unit owners for master policy deductibles. That\u0026rsquo;s another reason why it is important to have your own policy and why it is important that the coverage in your policy match up well with the association master policy.\u003c/p\u003e\n","href":"/faqs/business-insurance/do-i-need-a-condominium-policy-if-my-condominium-association-has-a-master-policy-for-the-complex/","link":"do-i-need-a-condominium-policy-if-my-condominium-association-has-a-master-policy-for-the-complex","objectID":"6bdc2c3164170a7d1935e239772df26a","title":"Do I need a condominium policy if my condominium association has a master policy for the complex?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eThat depends. Liability protection that you carry for personal injury and property damage will provide some protection while you are driving the rental car. Damage to the rental car would be covered under Collision and Comprehensive Coverage, if your policy has it. The rental car company may also try to recover damages for lost income while the rental car is out of service. Your auto policy may or may not protect you against this claim; the best way to know is to look at your policy or ask us to review it for you. Credit card companies often provide protection against these kinds of rental car claims so you should check there to see what the provisions and restrictions might be. Finally, you can purchase a Collision Damage Waiver - CDW - from the rental car company. This isn\u0026rsquo;t actually insurance but a release from financial liability you might otherwise be charged with as a result of damaging the rental car. The CDW is expensive at $8 to $12 a day. This would amount to over $4,000 a year for very limited coverage. Still, if you do not have protection via your auto policy or credit card, paying the CDW over a few days may be preferable than being personally accountable for $15,000 or $20,000 or more to replace the rental car.\u003c/p\u003e\n","href":"/faqs/personal-insurance/do-i-need-to-buy-insurance-from-the-rental-car-company-if-i-have-my-own-personal-automobile-insurance/","link":"do-i-need-to-buy-insurance-from-the-rental-car-company-if-i-have-my-own-personal-automobile-insurance","objectID":"ccafb650ac31423d33333481c7da2439","title":"Do I need to buy insurance from the rental car company if I have my own personal automobile insurance?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eA standard homeowner policy provides coverage equal to 10% of the limit for Coverage C of a homeowner policy or $1,000, whichever is greater. This coverage is useful for protecting you while traveling and for other temporary situations. If you have property in excess of these amounts away from home or property that is kept away from your residence premises for extended periods, you should consider additional protection.\u003c/p\u003e\n\n\u003cp\u003eThe 10% limitation for household property, is for property at an Insureds Residence Premise\u0026hellip;\u0026hellip;There is no limitation for property carried on vacation or stored in a storage unit. (except whatever the contents limit is on the property)\u003c/p\u003e\n","href":"/faqs/personal-insurance/does-my-homeowner-policy-cover-my-possessions-when-they-are-not-in-my-house/","link":"does-my-homeowner-policy-cover-my-possessions-when-they-are-not-in-my-house","objectID":"12f40d67b903f14b78e1e6a07289683a","title":"Does my homeowner policy cover my possessions when they are not in my house?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eYour policy will normally adjust for differences in other state requirements if you have the required minimum coverage for your state. Personal automobile policy protection is only applicable in the United States, US territories and possessions and the provinces of Canada.\u003c/p\u003e\n","href":"/faqs/personal-insurance/how-does-my-automobile-policy-protect-me-what-about-when-im-driving-in-another-country/","link":"how-does-my-automobile-policy-protect-me-when-im-driving-in-other-states-that-may-require-different-limits-or-types-of-coverage-what-about-when-im-driving-in-another-country","objectID":"0c179fb198dda2e1b8705d80da510e77","title":"How does my automobile policy protect me when I'm driving in other states that may require different limits or types of coverage? What about when I'm driving in another country?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eYou should review all of your insurance needs at least once a year. If you have a major life change, you should contact your insurance agent or company representative. The change in your life may have a significant impact on your insurance needs. Life changes may include:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eMarriage or divorce\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eA child or grandchild who is born or adopted\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eSignificant changes in your health or that of your spouse/domestic partner\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eTaking on the financial responsibility of an aging parent\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003ePurchasing a new home\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eA loved one who requires long-term care\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eRefinancing your home\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eComing into an inheritance\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cem\u003eSource: Insurance Information Institute www.iii.org\u003c/em\u003e\u003c/p\u003e\n","href":"/faqs/life-insurance/how-often-should-i-review-my-life-insurance-policy/","link":"how-often-should-i-review-my-life-insurance-policy","objectID":"d70f7095ca83006f94cf747fed59d6bb","title":"How often should I review my life insurance policy?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eHomeowner policies specifically exclude reimbursement for damage caused by flood. Your home may be a significant distance from a major body of water but still be exposed to flood risk if your home was built in a flood plain. The National Flood Insurance Program has a flood risk indicator on their website. All you have to do is enter your property address and you will get an indication of the degree of flood risk you face. Our agency can get flood coverage for you. For an indication of the cost, the National Flood Insurance Site also has a \u0026lsquo;quick quote\u0026rsquo; table of premiums to give you an idea.\u003c/p\u003e\n","href":"/faqs/personal-insurance/im-not-near-any-body-of-water.-is-there-any-particular-reason-doesnt-my-homeowner-policy-provide-flood-coverage/","link":"im-not-near-any-body-of-water.-is-there-any-particular-reason-why-i-would-need-flood-insurance-doesnt-my-homeowner-policy-provide-flood-coverage","objectID":"e34e04743f94d62b8c05e0c917e0a908","title":"I'm not near any body of water. Is there any particular reason why I would need flood insurance? Doesn't my homeowner policy provide flood coverage?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eThat depends. A business auto policy by itself won\u0026rsquo;t extend protection to rented autos unless you have amended it. You can get protection for situations where you rent autos if you add Hired Auto Liability and Physical Damage coverage.\u003c/p\u003e\n","href":"/faqs/business-insurance/if-i-rent-a-car-or-truck-am-i-protected-against-loss-by-my-business-auto-policy/","link":"if-i-rent-a-car-or-truck-am-i-protected-against-loss-by-my-business-auto-policy","objectID":"200c0f478cf48e3f2d3c94afb3e2b4c5","title":"If I rent a car or truck am I protected against loss by my business auto policy?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eIf you have a homeowner policy your boat might be covered but there are limitations. Automobile policies do not extend coverage to boats. Boat coverage can sometimes be increased by modifying a homeowner policy but a separate boat policy may be needed.\u003c/p\u003e\n","href":"/faqs/business-insurance/is-my-boat-insured-if-i-have-an-auto-or-homeowner-policy/","link":"is-my-boat-insured-if-i-have-an-auto-or-homeowner-policy","objectID":"bbc581d9385b7267b125c5de6e79c5ff","title":"Is my boat insured if I have an auto or homeowner policy?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eRenters policies provide several benefits. A renters policy will provide compensation for many types of loss to your personal property. Renters policies also include liability protection. This can be especially important because a fire, caused by your negligence, could damage a large number of other rental units and the property contained in them. Liability coverage will normally cover your legal obligations to compensate other parties in cases like this as well as for other instances where you are legally liable for damage of loss.\u003c/p\u003e\n","href":"/faqs/personal-insurance/what-are-the-benefits-of-a-renters-policy/","link":"what-are-the-benefits-of-a-renters-policy","objectID":"b5dc18a6c9f1eea01228cffd58dba8ad","title":"What are the benefits of a renters policy?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eThe claim process has a few variations but these are the essential steps once the claim has been submitted to the insurance company:\u003c/p\u003e\n\n\u003col\u003e\n\u003cli\u003e\u003cp\u003eYou will be contacted by an insurance company adjuster to gather detailed information about your claim.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eOften, someone from the insurance company will inspect your auto or property for damage or will ask you to provide evidence of value and ownership for loss to property that is not a vehicle or real property.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eAn estimate is prepared.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eA check is delivered.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eSometimes differences in actual and estimated damages arise, especially after repair work has been undertaken. Every attempt is made to resolve these differences and sometimes a supplemental check is prepared.\u003c/p\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\n\u003cp\u003eIt is the responsibility of the insurance company to settle and pay your claim and the responsibility of our agency to make sure that is done as quickly and fairly as possible with a minimum of uncertainty and bother for you. We monitor claim progress closely and communicate with you throughout to make sure you are satisfied.\u003c/p\u003e\n","href":"/faqs/personal-insurance/what-happens-after-i-file-a-claim/","link":"what-happens-after-i-file-a-claim","objectID":"cd85813d26ab5d73fff71ae07e56a6b4","title":"What happens after I file a claim?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eIf you own, lease (long term) or finance your vehicle then you will file a claim with your insurance company. You will have to pay any deductible amount. Payment for your loss will include payment to the finance or leasing company, if any. If you cause damage to other vehicles or property, your insurance company will handle that with little or no involvement on your part, in most cases.\u003c/p\u003e\n","href":"/faqs/personal-insurance/what-happens-if-i-cause-a-car-accident/","link":"what-happens-if-i-cause-a-car-accident","objectID":"a334c2804979fd5e47dce8c84652a05d","title":"What happens if I cause a car accident?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eIn most cases the other driver’s insurance policy would respond and reimburse you for damages to your vehicle, property or injuries. In some cases, as when you or your passengers are injured and the other driver has inadequate or no insurance, coverage from your own policy may apply (Uninsured or Underinsured Motorist Coverage).\u003c/p\u003e\n","href":"/faqs/personal-insurance/what-if-another-driver-hits-my-car/","link":"what-if-another-driver-hits-my-car","objectID":"926c65a277bcc1366e1e13c88fff651a","title":"What if another driver hits my car?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eThat depends on the kind of business you engage in. All businesses need basic liability to protect them against acts of owners or employees for which the business might be considered legally liable. Professional service providers often need special liability protection. Examples might be professional liability protection for lawyers, doctors, architects or software designers. Another example are businesses that manufacture or distribute a product; they typically need product liability protection. It\u0026rsquo;s always a good idea to review the kinds of liability exposures your business might have when updating or initiating an insurance program.\u003c/p\u003e\n\n\u003cp\u003eBusinesses that own autos or use non-owned autos in the conduct of their business will probably need a business auto policy.\u003c/p\u003e\n\n\u003cp\u003eAll businesses have property which can be divided up into several categories: office or other equipment, inventory, real property, etc. and it is a good idea to think about your ability to replace any damaged or lost property in these categories. If the possible amount of loss exceeds your comfort level then insurance might be a good altenative.\u003c/p\u003e\n\n\u003cp\u003eYou also need to think about how long you could afford to be out of business. Insurance, known as business interruption insurance, can pay suppliers, salaries and other costs you might incur even if your business income were to be interrupted by a covered cause of loss.\u003c/p\u003e\n","href":"/faqs/business-insurance/what-kind-of-insurance-does-my-business-need/","link":"what-kind-of-insurance-does-my-business-need","objectID":"b772e62a4311843ece6e43d289cfade4","title":"What kind of insurance does my business need?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eGenerally the answer is no. One claim is not a cause for concern on the part of insurance companies. But a pattern of claims may result in a premium increase or cancellation. So if you have a claim that is the third in three years, for example, that will be viewed differently than having one claim only. Individual claims that are suggestive of gross negligence can also result in significant premium increase or cancellation. An example might be an auto accident accompanied by a reckless driving or driving under the influence conviction.\u003c/p\u003e\n","href":"/faqs/personal-insurance/will-filing-a-claim-make-my-premium-increase-or-result-in-my-policy-being-canceled/","link":"will-filing-a-claim-make-my-premium-increase-or-result-in-my-policy-being-canceled","objectID":"f3b116792fb9a971beda8d17016af92d","title":"Will filing a claim make my premium increase or result in my policy being canceled?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eYour automobile policy protection is extended to anyone you grant permission to drive your car. You do not need to explicitly provide permission, the other person only needs to have a reasonable belief that they are driving with permission.\u003c/p\u003e\n","href":"/faqs/personal-insurance/will-my-automobile-policy-protect-a-friend-or-relative-if-i-loan-my-vehicle-to-them/","link":"will-my-automobile-policy-protect-a-friend-or-relative-if-i-loan-my-vehicle-to-them","objectID":"a69982424a766cc881defc81710ebea4","title":"Will my automobile policy protect a friend or relative if I loan my vehicle to them?","type":"faqs"},{"date":-62135596800,"excerpt":"\u003cp\u003eTypical policies provide coverage for you and relatives that live with you. So, if your roommate is not a relative you will not be protected under his or her policy. Renters policies are very affordable, starting at not much more than $150 a year and they provide liability protection as well as coverage for your personal possessions.\u003c/p\u003e\n","href":"/faqs/personal-insurance/will-my-roommates-renters-policy-cover-me-as-well/","link":"will-my-roommates-renters-policy-cover-me-as-well","objectID":"5c7020d985a4453245001d71f2247175","title":"Will my roommate's renters policy cover me as well?","type":"faqs"}]